DulanyaW/COMPSYS301/Uma/CS301_15.cydsn/Additional_HD.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "isr_1.h"
#include "isr_3.h"
#include "Comp_3.h"
#include "Sout_R_aliases.h"
#include "Sout_R.h"
#include "Sin_M2_aliases.h"
#include "Sin_M2.h"
#include "timer_clock_1.h"
#include "Timer_2.h"
#include "Comp_0.h"
#include "comp_clk.h"
#include "Sin_M1_aliases.h"
#include "Sin_M1.h"
#include "Timer_1.h"
#include "LED_0_aliases.h"
#include "LED_0.h"
#include "Comp_1.h"
#include "Sin_L_aliases.h"
#include "Sin_L.h"
#include "LED_1_aliases.h"
#include "LED_1.h"
#include "Comp_2.h"
#include "Sin_R_aliases.h"
#include "Sin_R.h"
#include "LED_2_aliases.h"
#include "LED_2.h"
#include "Sout_L_aliases.h"
#include "Sout_L.h"
#include "Sout_M2_aliases.h"
#include "Sout_M2.h"
#include "Sout_M1_aliases.h"
#include "Sout_M1.h"
#include "timer_clock_2.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

